Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 98, 256)           37888     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 32, 256)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 30, 256)           196864    
_________________________________________________________________
dense (Dense)                (None, 30, 1024)          263168    
_________________________________________________________________
dropout (Dropout)            (None, 30, 1024)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 30, 512)           524800    
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 512)           0         
_________________________________________________________________
dense_2 (Dense)              (None, 30, 256)           131328    
_________________________________________________________________
dense_3 (Dense)              (None, 30, 128)           32896     
_________________________________________________________________
flatten (Flatten)            (None, 3840)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 3841      
=================================================================
Total params: 1,190,785
Trainable params: 1,190,785
Non-trainable params: 0
_________________________________________________________________
Batch size = 8
learn rate = 0.01
Num epochs = 39

train:
RMSE:2.2565
R:0.3561
p:0.0001
R_spear:0.3578
NRMSE:0.2821
CCC:0.08815887623310115


test:
RMSE:2.2278
R:-0.1452
p:0.4698
R_spear:-0.1566
NRMSE:0.2785
CCC:-0.03073420603301082
