Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 98, 256)           37888     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 32, 256)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 30, 256)           196864    
_________________________________________________________________
dense (Dense)                (None, 30, 1024)          263168    
_________________________________________________________________
dropout (Dropout)            (None, 30, 1024)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 30, 512)           524800    
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 512)           0         
_________________________________________________________________
dense_2 (Dense)              (None, 30, 256)           131328    
_________________________________________________________________
dense_3 (Dense)              (None, 30, 128)           32896     
_________________________________________________________________
flatten (Flatten)            (None, 3840)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 3841      
=================================================================
Total params: 1,190,785
Trainable params: 1,190,785
Non-trainable params: 0
_________________________________________________________________
Batch size = 16
learn rate = 0.0001
Num epochs = 82

train:
RMSE:0.3727
R:0.9838
p:0.0
R_spear:0.9875
NRMSE:0.0466
CCC:0.9903590295653534


test:
RMSE:2.2756
R:0.0629
p:0.7505
R_spear:0.0594
NRMSE:0.2844
CCC:0.060606060606060615
